ИИ_Агент/src/Enums/ИИА_ТипСообщения/ИИА_ТипСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИИА_ТипСообщения</name>
  <enumValues>
    <name>Текст</name>
  </enumValues>
  <enumValues>
    <name>Запрос</name>
  </enumValues>
  <enumValues>
    <name>Код</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

ИИ_Агент/src/CommonForms/ИИА_Агент/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Получаем или создаем диалог текущего пользователя
	ТекущийДиалог = ИИА_Клиент.НайтиИлиСоздатьДиалогПользователя();
	
	// Загружаем сообщения
	ОбновитьСообщения();
	
	// Устанавливаем начальные значения
	ТекущийТипСообщения = "Чат";
	СтрокаСтатуса = "Готов к работе";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОтправить(Команда)
	
	Если ПустаяСтрока(ТекущийТекст) Тогда
		Возврат;
	КонецЕсли;
	
	// Отправляем сообщение
	Результат = ИИА_Клиент.ОтправитьСообщение(
		ТекущийДиалог,
		ТекущийТипСообщения,
		ТекущийТекст
	);
	
	// Обновляем список сообщений
	ОбновитьСообщения();
	
	// Обновляем статус по usage
	Если Результат.Usage <> Неопределено Тогда
		Если Результат.Usage.ОстатокКредитов > 0 Тогда
			СтрокаСтатуса = "Осталось " + Формат(Результат.Usage.ОстатокКредитов, "ЧН=0; ЧГ=") + " credits";
		Иначе
			СтрокаСтатуса = "Токенов использовано: " + Формат(Результат.Usage.TotalTokens, "ЧН=0; ЧГ=");
		КонецЕсли;
	КонецЕсли;
	
	// Очищаем поле ввода
	ТекущийТекст = "";
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверитьЗапрос(Команда)
	
	ВыбраннаяСтрока = СообщенияФормы.ТекущаяСтрока;
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбраннаяСтрока.ТипСообщения <> ПредопределенноеЗначение("Перечисление.ИИА_ТипСообщения.Запрос") Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ВыбраннаяСтрока.ТекстКода) Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем запрос
	Результат = ИИА_Клиент.ПроверитьЗапрос(ВыбраннаяСтрока.ТекстКода);
	
	// Формируем сообщение о результате
	Если Результат.Успех Тогда
		ТекстОшибки = "Запрос выполнен успешно";
		ТипСообщенияОшибки = ПредопределенноеЗначение("Перечисление.ИИА_ТипСообщения.Текст");
	Иначе
		ТекстОшибки = "Ошибка: " + Результат.Сообщение;
		ТипСообщенияОшибки = ПредопределенноеЗначение("Перечисление.ИИА_ТипСообщения.Ошибка");
	КонецЕсли;
	
	// Добавляем системное сообщение в диалог через сервер
	ДобавитьСистемноеСообщение(ТекстОшибки, ТипСообщенияОшибки);
	
	// Обновляем список сообщений
	ОбновитьСообщения();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСкопировать(Команда)
	
	ВыбраннаяСтрока = СообщенияФормы.ТекущаяСтрока;
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбраннаяСтрока.ТипСообщения <> ПредопределенноеЗначение("Перечисление.ИИА_ТипСообщения.Запрос") 
		И ВыбраннаяСтрока.ТипСообщения <> ПредопределенноеЗначение("Перечисление.ИИА_ТипСообщения.Код") Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ВыбраннаяСтрока.ТекстКода) Тогда
		Возврат;
	КонецЕсли;
	
	// Копируем в буфер обмена
	Попытка
	//	ПомещениеВБуферОбмена(ВыбраннаяСтрока.ТекстКода);
		Сообщить("Скопировано в буфер обмена");
	Исключение
		Сообщить("Ошибка копирования в буфер обмена: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНастройки(Команда)
	
	// Открываем форму настроек пользователя
	// TODO: Реализовать открытие формы настроек
	Сообщить("Настройки (в разработке)");
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииКлиентскогоМодуля

&НаКлиенте
// Обновляет список сообщений на форме
//
Процедура ОбновитьСообщения()
	
	НовыеСообщения = ИИА_Клиент.ЗагрузитьСообщенияДиалога(ТекущийДиалог);
	
	// Очищаем существующую таблицу и заполняем новыми данными
	СообщенияФормы.Очистить();
	
	Для Каждого Строка Из НовыеСообщения Цикл
		
		НоваяСтрока = СообщенияФормы.Добавить();
		НоваяСтрока.Время = Строка.Время;
		НоваяСтрока.Автор = Строка.Автор;
		НоваяСтрока.ТипСообщения = Строка.ТипСообщения;
		НоваяСтрока.Текст = Строка.Текст;
		НоваяСтрока.ТекстКода = Строка.ТекстКода;
		НоваяСтрока.Статус = Строка.Статус;
		НоваяСтрока.UsageTokens = Строка.UsageTokens;
		
	КонецЦикла;
	
	СообщенияФормы.Отбор.Очистить();
	
	// Прокручиваем к последнему сообщению
	Если СообщенияФормы.Количество() > 0 Тогда
		СообщенияФормы.ТекущаяСтрока = СообщенияФормы[СообщенияФормы.Количество() - 1];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Добавляет системное сообщение в диалог
//
// Параметры:
//  Текст - Строка - текст сообщения
//  ТипСообщения - ПеречислениеСсылка.ИИА_ТипСообщения - тип сообщения
//
Процедура ДобавитьСистемноеСообщение(Текст, ТипСообщения)
	
	ИИА_ВызовСервера.ДобавитьСистемноеСообщениеНаСервере(ТекущийДиалог, Текст, ТипСообщения);
	
КонецПроцедуры

#КонецОбласти
